In [1]:
# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np
import re
# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
#import scipy.stats as stats
import scipy.stats as st
import scipy.stats as stats
from scipy.stats import shapiro, poisson, chisquare, expon, kstest


# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [2]:
df_raw= pd.read_csv("HR_RAW_DATA.csv")
df_raw.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [3]:
# Dataset HR_RAW_DATA
print(f"\nInformación del 1º dataset")
print("-----------------------------------")
print(df_raw.info())
print("-----------------------------------")
print(f"\nNombre de las columnas:")
print(df_raw.columns)
print("-----------------------------------")
print(f"\nEstructura datos:")
print(df_raw.shape)
print("------------------------------------")
print(f"\nParámetros estadísticos básicos:")
print(df_raw.describe().T)
print("-----------------------------------")
print(f"\nEl tipo de datos:")
print(df_raw.dtypes)

Información del 1º dataset
-----------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 42 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Unnamed: 0                1614 non-null   int64
 1   Age                       1614 non-null   object
 2   Attrition                 1614 non-null   object
 3   BusinessTravel            842 non-null    object
 4   DailyRate                 1614 non-null   object
 5   Department                302 non-null    object
 6   DistanceFromHome          1614 non-null   int64
 7   Education                 1614 non-null   int64
 8   EducationField            869 non-null    object
 9   employeecount             1614 non-null   int64
 10  employeenumber            1183 non-null   object
 11  EnvironmentSatisfaction   1614 non-null   int64
 12  Gender                    1614 non-null   int64
 13  HourlyRate                1614 non-null   object
 14  JobInvolvement            1614 non-null   int64
 15  JobLevel                  1614 non-null   int64
 16  JobRole                   1614 non-null   object
 17  JobSatisfaction           1614 non-null   int64
 18  MaritalStatus             963 non-null    object
 19  MonthlyIncome             771 non-null    object
 20  MonthlyRate               1614 non-null   int64
 21  NUMCOMPANIESWORKED        1614 non-null   int64
 22  Over18                    713 non-null    object
 23  OverTime                  938 non-null    object
 24  PercentSalaryHike         1614 non-null   int64
 25  PerformanceRating         1419 non-null   object
 26  RelationshipSatisfaction  1614 non-null   int64
 27  StandardHours             419 non-null    object
 28  StockOptionLevel          1614 non-null   int64
 29  TOTALWORKINGYEARS         1088 non-null   object
 30  TrainingTimesLastYear     1614 non-null   int64
 31  WORKLIFEBALANCE           1506 non-null   object
 32  YearsAtCompany            1614 non-null   int64
 33  YearsInCurrentRole        34 non-null     object
 34  YearsSinceLastPromotion   1614 non-null   int64
 35  YEARSWITHCURRMANAGER      1614 non-null   int64
 36  SameAsMonthlyIncome       771 non-null    object
 37  DateBirth                 1614 non-null   int64
 38  Salary                    1614 non-null   object
 39  RoleDepartament           302 non-null    object
 40  NUMBERCHILDREN            0 non-null      float64
 41  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(19), object(22)
memory usage: 529.7+ KB
None
-----------------------------------

Nombre de las columnas:
Index(['Unnamed: 0', 'Age', 'Attrition', 'BusinessTravel', 'DailyRate',
       'Department', 'DistanceFromHome', 'Education', 'EducationField',
       'employeecount', 'employeenumber', 'EnvironmentSatisfaction', 'Gender',
       'HourlyRate', 'JobInvolvement', 'JobLevel', 'JobRole',
       'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome', 'MonthlyRate',
       'NUMCOMPANIESWORKED', 'Over18', 'OverTime', 'PercentSalaryHike',
       'PerformanceRating', 'RelationshipSatisfaction', 'StandardHours',
       'StockOptionLevel', 'TOTALWORKINGYEARS', 'TrainingTimesLastYear',
       'WORKLIFEBALANCE', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YEARSWITHCURRMANAGER',
       'SameAsMonthlyIncome', 'DateBirth', 'Salary', 'RoleDepartament',
       'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')
-----------------------------------

Estructura datos:
(1614, 42)
------------------------------------

Parámetros estadísticos básicos:
                           count          mean          std     min      25%  \
Unnamed: 0                1614.0    806.500000   466.065982     0.0   403.25
DistanceFromHome          1614.0      4.527261    14.591913   -49.0     2.00
Education                 1614.0      2.925031     1.022357     1.0     2.00
employeecount             1614.0      1.000000     0.000000     1.0     1.00
EnvironmentSatisfaction   1614.0      4.294919     6.993559     1.0     2.00
Gender                    1614.0      0.398389     0.489718     0.0     0.00
JobInvolvement            1614.0      2.739777     0.711567     1.0     2.00
JobLevel                  1614.0      2.068154     1.101344     1.0     1.00
JobSatisfaction           1614.0      2.738538     1.106163     1.0     2.00
MonthlyRate               1614.0  14284.495663  7110.414585  2094.0  8001.00
NUMCOMPANIESWORKED        1614.0      2.673482     2.506152     0.0     1.00
PercentSalaryHike         1614.0     15.165428     3.648610    11.0    12.00
RelationshipSatisfaction  1614.0      2.704461     1.079031     1.0     2.00
StockOptionLevel          1614.0      0.791202     0.842396     0.0     0.00
TrainingTimesLastYear     1614.0      2.809789     1.297765     0.0     2.00
YearsAtCompany            1614.0      7.132590     6.124237     0.0     3.00
YearsSinceLastPromotion   1614.0      2.245973     3.235665     0.0     0.00
YEARSWITHCURRMANAGER      1614.0      4.220570     3.562695     0.0     2.00
DateBirth                 1614.0   1986.076208     9.101332  1963.0  1980.00
NUMBERCHILDREN               0.0           NaN          NaN     NaN      NaN

                              50%       75%      max
Unnamed: 0                  806.5   1209.75   1613.0
DistanceFromHome              5.0     11.00     29.0
Education                     3.0      4.00      5.0
employeecount                 1.0      1.00      1.0
EnvironmentSatisfaction       3.0      4.00     49.0
Gender                        0.0      1.00      1.0
JobInvolvement                3.0      3.00      4.0
JobLevel                      2.0      3.00      5.0
JobSatisfaction               3.0      4.00      4.0
MonthlyRate               14248.5  20364.00  26999.0
NUMCOMPANIESWORKED            2.0      4.00      9.0
PercentSalaryHike            14.0     18.00     25.0
RelationshipSatisfaction      3.0      4.00      4.0
StockOptionLevel              1.0      1.00      3.0
TrainingTimesLastYear         3.0      3.00      6.0
YearsAtCompany                5.0      9.00     40.0
YearsSinceLastPromotion       1.0      3.00     15.0
YEARSWITHCURRMANAGER          3.0      7.00     17.0
DateBirth                  1987.0   1993.00   2005.0
NUMBERCHILDREN                NaN       NaN      NaN
-----------------------------------

El tipo de datos:
Unnamed: 0                    int64
Age                          object
Attrition                    object
BusinessTravel               object
DailyRate                    object
Department                   object
DistanceFromHome              int64
Education                     int64
EducationField               object
employeecount                 int64
employeenumber               object
EnvironmentSatisfaction       int64
Gender                        int64
HourlyRate                   object
JobInvolvement                int64
JobLevel                      int64
JobRole                      object
JobSatisfaction               int64
MaritalStatus                object
MonthlyIncome                object
MonthlyRate                   int64
NUMCOMPANIESWORKED            int64
Over18                       object
OverTime                     object
PercentSalaryHike             int64
PerformanceRating            object
RelationshipSatisfaction      int64
StandardHours                object
StockOptionLevel              int64
TOTALWORKINGYEARS            object
TrainingTimesLastYear         int64
WORKLIFEBALANCE              object
YearsAtCompany                int64
YearsInCurrentRole           object
YearsSinceLastPromotion       int64
YEARSWITHCURRMANAGER          int64
SameAsMonthlyIncome          object
DateBirth                     int64
Salary                       object
RoleDepartament              object
NUMBERCHILDREN              float64
RemoteWork                   object
dtype: object

In [4]:
# Homogeneizamos las columnas Renombramos las columnas.
renombradas_hr_raw_data= {columna:columna.lower().replace('','') for columna in df_raw.columns}
# Usamos un diccionario con los nombres de columnas modificados para renombrar las columnas del DataFrame
df_raw.rename(columns = renombradas_hr_raw_data, inplace = True)
# Comprobamos que el diccionario se haya creado correctamente.
renombradas_hr_raw_data

{'Unnamed: 0': 'unnamed: 0',
 'Age': 'age',
 'Attrition': 'attrition',
 'BusinessTravel': 'businesstravel',
 'DailyRate': 'dailyrate',
 'Department': 'department',
 'DistanceFromHome': 'distancefromhome',
 'Education': 'education',
 'EducationField': 'educationfield',
 'employeecount': 'employeecount',
 'employeenumber': 'employeenumber',
 'EnvironmentSatisfaction': 'environmentsatisfaction',
 'Gender': 'gender',
 'HourlyRate': 'hourlyrate',
 'JobInvolvement': 'jobinvolvement',
 'JobLevel': 'joblevel',
 'JobRole': 'jobrole',
 'JobSatisfaction': 'jobsatisfaction',
 'MaritalStatus': 'maritalstatus',
 'MonthlyIncome': 'monthlyincome',
 'MonthlyRate': 'monthlyrate',
 'NUMCOMPANIESWORKED': 'numcompaniesworked',
 'Over18': 'over18',
 'OverTime': 'overtime',
 'PercentSalaryHike': 'percentsalaryhike',
 'PerformanceRating': 'performancerating',
 'RelationshipSatisfaction': 'relationshipsatisfaction',
 'StandardHours': 'standardhours',
 'StockOptionLevel': 'stockoptionlevel',
 'TOTALWORKINGYEARS': 'totalworkingyears',
 'TrainingTimesLastYear': 'trainingtimeslastyear',
 'WORKLIFEBALANCE': 'worklifebalance',
 'YearsAtCompany': 'yearsatcompany',
 'YearsInCurrentRole': 'yearsincurrentrole',
 'YearsSinceLastPromotion': 'yearssincelastpromotion',
 'YEARSWITHCURRMANAGER': 'yearswithcurrmanager',
 'SameAsMonthlyIncome': 'sameasmonthlyincome',
 'DateBirth': 'datebirth',
 'Salary': 'salary',
 'RoleDepartament': 'roledepartament',
 'NUMBERCHILDREN': 'numberchildren',
 'RemoteWork': 'remotework'}

In [5]:
def renombrar_columnas(df_raw):
    # Mostramos los nombres de las columnas
    print(df_raw.columns)
    # Renombramos a minúsculas
    df_raw.columns = df_raw.columns.str.lower()
    # Reemplazamos espacios y caracteres especiales por guiones bajos
    df_raw.rename(columns=lambda x: x.replace(' ', '_')
                          .replace('-', '_')
                          .replace('dailyrate', 'daily_rate')
                          .replace('distancefromhome', 'distance_from_home')
                          .replace('educationfield', 'education_field')
                          .replace('employeecount', 'employee_count')
                          .replace('employeenumber', 'employee_number')
                          .replace('environmentsatisfaction', 'environment_satisfaction')
                          .replace('hourlyrate', 'hourly_rate')
                          .replace('jobinvolvement', 'job_involvement')
                          .replace('joblevel', 'job_level')
                          .replace('jobsatisfaction', 'job_satisfaction')
                          .replace('monthlyincome', 'monthly_income')
                          .replace('monthlyrate', 'monthly_rate')
                          .replace('numcompaniesworked', 'num_companies_worked')
                          .replace('percentsalaryhike', 'percent_salary_hike')
                          .replace('performancerating', 'performance_rating')
                          .replace('relationshipsatisfaction', 'relationship_satisfaction')
                          .replace('standardhours', 'standard_hours')
                          .replace('stockoptionlevel', 'stock_option_level')
                          .replace('totalworkingyears', 'total_working_years')
                          .replace('trainingtimeslastyear', 'training_times_last_year')
                          .replace('worklifebalance', 'work_life_balance')
                          .replace('yearsatcompany', 'years_at_company')
                          .replace('yearsincurrentrole', 'years_in_current_role')
                          .replace('yearssincelastpromotion', 'years_since_last_promotion')
                          .replace('yearswithcurrmanager', 'years_with_curr_manager')
                          .replace('sameasmonthlyincome', 'same_as_monthly_income')
                          .replace('datebirth', 'date_birth')
                          .replace('roledepartament', 'role_departament')
                          .replace('numberchildren', 'number_children')
                          .replace('remotework', 'remote_work'), inplace=True)
    # Mostramos los nombres de las columnas
    print(df_raw.columns)
    return df_raw
# Llamamos a la función
df_renombradas= renombrar_columnas(df_raw)
df_renombradas.columns

Index(['unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'over18', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager',
       'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament',
       'numberchildren', 'remotework'],
      dtype='object')
Index(['unnamed:_0', 'age', 'attrition', 'businesstravel', 'daily_rate',
       'department', 'distance_from_home', 'education', 'education_field',
       'employee_count', 'employee_number', 'environment_satisfaction',
       'gender', 'hourly_rate', 'job_involvement', 'job_level', 'jobrole',
       'job_satisfaction', 'maritalstatus', 'monthly_income', 'monthly_rate',
       'num_companies_worked', 'over18', 'overtime', 'percent_salary_hike',
       'performance_rating', 'relationship_satisfaction', 'standard_hours',
       'stock_option_level', 'total_working_years', 'training_times_last_year',
       'work_life_balance', 'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager',
       'sameasmonthly_income', 'date_birth', 'salary', 'role_departament',
       'number_children', 'remote_work'],
      dtype='object')

Index(['unnamed:_0', 'age', 'attrition', 'businesstravel', 'daily_rate',
       'department', 'distance_from_home', 'education', 'education_field',
       'employee_count', 'employee_number', 'environment_satisfaction',
       'gender', 'hourly_rate', 'job_involvement', 'job_level', 'jobrole',
       'job_satisfaction', 'maritalstatus', 'monthly_income', 'monthly_rate',
       'num_companies_worked', 'over18', 'overtime', 'percent_salary_hike',
       'performance_rating', 'relationship_satisfaction', 'standard_hours',
       'stock_option_level', 'total_working_years', 'training_times_last_year',
       'work_life_balance', 'years_at_company', 'years_in_current_role',
       'years_since_last_promotion', 'years_with_curr_manager',
       'sameasmonthly_income', 'date_birth', 'salary', 'role_departament',
       'number_children', 'remote_work'],
      dtype='object')

In [6]:
df_raw.to_csv("1_df_columnas_renombradas.csv", index=False)

In [7]:
# Quitamos el simbolo del dolar.
df_raw['daily_rate'] = df_raw['daily_rate'].str.replace('$', '', regex=False).astype(object)
print(f"\nEl resultado de la columna daily_rate sin simbolo dolar:")
df_raw['daily_rate']

El resultado de la columna daily_rate sin simbolo dolar:

0        684,0
1        699,0
2        532,0
3        359,0
4       1319,0
         ...
1609     530,0
1610     805,0
1611     903,0
1612    1229,0
1613     566,0
Name: daily_rate, Length: 1614, dtype: object

In [8]:
# Convertir todas las filas de la columna "JobRole" a minúsculas
df_raw['jobrole'] = df_raw['jobrole'].str.lower()
print(df_raw)

      unnamed:_0 age attrition businesstravel daily_rate  \
0              0  51        No            NaN      684,0
1              1  52        No            NaN      699,0
2              2  42        No  travel_rarely      532,0
3              3  47        No  travel_rarely      359,0
4              4  46        No            NaN     1319,0
...          ...  ..       ...            ...        ...
1609        1609  36       Yes  travel_rarely      530,0
1610        1610  45        No     non-travel      805,0
1611        1611  39        No  travel_rarely      903,0
1612        1612  36        No     non-travel     1229,0
1613        1613  46        No            NaN      566,0

                    department  distance_from_home  education  \
0                          NaN                   6          3
1                          NaN                   1          4
2      Research & Development                    4          2
3                          NaN                   2          4
4                          NaN                   3          3
...                        ...                 ...        ...
1609                       NaN                   3          1
1610                       NaN                   4          2
1611                       NaN                 -13          5
1612                       NaN                   8          4
1613                       NaN                   7          2

       education_field  employee_count employee_number  \
0                  NaN               1           162,0
1        Life Sciences               1           259,0
2     Technical Degree               1           319,0
3              Medical               1             NaN
4     Technical Degree               1             NaN
...                ...             ...             ...
1609     Life Sciences               1           967,0
1610               NaN               1           972,0
1611               NaN               1             NaN
1612  Technical Degree               1           990,0
1613           Medical               1             NaN

      environment_satisfaction  gender hourly_rate  job_involvement  \
0                            1       0          51                3
1                            3       0          65                2
2                            3       0          58                3
3                            1       1          82                3
4                            1       1          45                4
...                        ...     ...         ...              ...
1609                         3       0          51                2
1610                         3       0          57                3
1611                        13       0          41                4
1612                         1       0          84                3
1613                         4       0          75                3

      job_level                   jobrole  job_satisfaction maritalstatus  \
0             5        research director                  3           NaN
1             5                  manager                  3           NaN
2             5                  manager                  4       Married
3             4        research director                  3       Married
4             4          sales executive                  1      Divorced
...         ...                       ...               ...           ...
1609          3          sales executive                  4       Married
1610          2    laboratory technician                  2           NaN
1611          3          sales executive                  3        Single
1612          2          sales executive                  4      Divorced
1613          3   manufacturing director                  3           NaN

     monthly_income  monthly_rate  num_companies_worked over18 overtime  \
0           19537,0          6462                     7      Y       No
1           19999,0          5678                     0    NaN      NaN
2           19232,0          4933                     1    NaN       No
3           17169,0         26703                     3      Y      NaN
4               NaN          7739                     2      Y       No
...             ...           ...                   ...    ...      ...
1609        10325,0          5518                     1      Y      NaN
1610         4447,0         23163                     1    NaN      NaN
1611            NaN          2560                     0    NaN       No
1612            NaN         25952                     4    NaN       No
1613        10845,0         24208                     6      Y      NaN

      percent_salary_hike performance_rating  relationship_satisfaction  \
0                      13                3,0                          3
1                      14                3,0                          1
2                      11                3,0                          4
3                      19                3,0                          2
4                      12                3,0                          4
...                   ...                ...                        ...
1609                   11                NaN                          1
1610                   12                3,0                          2
1611                   18                3,0                          4
1612                   13                NaN                          4
1613                   13                3,0                          2

     standard_hours  stock_option_level total_working_years  \
0               NaN                   0                 NaN
1               NaN                   1                34,0
2               NaN                   0                22,0
3               NaN                   2                 NaN
4               NaN                   1                 NaN
...             ...                 ...                 ...
1609            NaN                   1                 NaN
1610            NaN                   0                 NaN
1611            NaN                   0                 9,0
1612            NaN                   2                12,0
1613            NaN                   1                 NaN

      training_times_last_year work_life_balance  years_at_company  \
0                            5               3,0                20
1                            5               3,0                33
2                            3               NaN                22
3                            2               NaN                20
4                            5               3,0                19
...                        ...               ...               ...
1609                         6               3,0                16
1610                         5               2,0                 9
1611                         3               3,0                 8
1612                         3               3,0                 7
1613                         3               3,0                 8

     years_in_current_role  years_since_last_promotion  \
0                      NaN                          15
1                      NaN                          11
2                      NaN                          11
3                      NaN                           5
4                      NaN                           2
...                    ...                         ...
1609                   NaN                           3
1610                   NaN                           0
1611                   NaN                           0
1612                   NaN                           0
1613                   NaN                           0

      years_with_curr_manager sameasmonthly_income  date_birth       salary  \
0                          15              19537,0        1972  1000000000$
1                           9              19999,0        1971  1000000000$
2                          15              19232,0        1981  1000000000$
3                           6              17169,0        1976  1000000000$
4                           8                  NaN        1977  1000000000$
...                       ...                  ...         ...          ...
1609                        7              10325,0        1987  1000000000$
1610                        8               4447,0        1978  1000000000$
1611                        7                  NaN        1984  1000000000$
1612                        7                  NaN        1987  1000000000$
1613                        7              10845,0        1977  1000000000$

                          role_departament  number_children remote_work
0                                      NaN              NaN         Yes
1                                      NaN              NaN           1
2      ManaGER  -  Research & Development               NaN           1
3                                      NaN              NaN       False
4                                      NaN              NaN           0
...                                    ...              ...         ...
1609                                   NaN              NaN           0
1610                                   NaN              NaN           1
1611                                   NaN              NaN         Yes
1612                                   NaN              NaN        True
1613                                   NaN              NaN           0

[1614 rows x 42 columns]

In [9]:
df_raw.head()

,unnamed:_0,age,attrition,businesstravel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,jobrole,job_satisfaction,maritalstatus,monthly_income,monthly_rate,num_companies_worked,over18,overtime,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,sameasmonthly_income,date_birth,salary,role_departament,number_children,remote_work
0,0,51,No,NaN,"684,0",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,research director,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,manager,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,manager,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0",NaN,2,4,Medical,1,NaN,1,1,82,3,4,research director,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sales executive,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [10]:
def reemplazar_valores(df_raw):
    # Reemplazamos los valores de la columna Gender (0 y 1 por 'Female' y 'Male')
    if 'gender' in df_raw.columns:
        df_raw['gender'] = df_raw['gender'].replace({0: 'Female', 1: 'Male'})
    
    # Reemplazar las comas por puntos en la columna 'daily_rate', si es necesario
    if 'daily_rate' in df_raw.columns:
        df_raw['daily_rate'] = df_raw['daily_rate'].apply(lambda x: str(x).replace(",", ".") if isinstance(x, str) else x)
        df_raw['daily_rate'] = pd.to_numeric(df_raw['daily_rate'], errors='coerce')  # Convertir a numérico
        df_raw['total_working_years'] = df_raw['total_working_years'].apply(lambda x: str(x).replace(",", ".") if isinstance(x, str) else x)
        df_raw['total_working_years'] = pd.to_numeric(df_raw['total_working_years'], errors='coerce')  # Convertir a numérico
    
    # Evaluar si hay valores duplicados
    duplicados = df_raw.duplicated().sum()
    print(f"\nHay {duplicados} registros duplicados")
    
    # Reemplazar valores negativos en la columna DistanceFromHome por la media
    if 'distance_from_home' in df_raw.columns:
        df_raw['distance_from_home'] = df_raw['distance_from_home'].apply(lambda x: df_raw['distance_from_home'].mean() if x < 0 else x)
    
    # Reemplazar valores faltantes en la columna 'age' por la media
    if 'age' in df_raw.columns:
        df_raw['age'] = pd.to_numeric(df_raw['age'], errors='coerce')  # Convertir a numérico
        df_raw['age'] = df_raw['age'].fillna(df_raw['age'].mean())  # Rellenar con la media
    
    # Reemplazar errores tipográficos en la columna 'marital_status'
    if 'marital_status' in df_raw.columns:
        df_raw['marital_status'] = df_raw['marital_status'].replace({'Marreid': 'Married'})
    
    # Eliminar columnas redundantes
    redundant_columns = ['employee_count', 'standard_hours', 'employee_number']
    df_raw = df_raw.drop(columns=[col for col in redundant_columns if col in df_raw.columns])
    
    # Eliminar columnas con valores constantes
    constant_columns = ['over18', 'sameasmonthly_income']
    df_raw = df_raw.drop(columns=[col for col in constant_columns if col in df_raw.columns])
    
    return df_raw

# Llamamos a la función
df= reemplazar_valores(df_raw)

# Mostramos los primeros registros para verificar los cambios
print(df)

Hay 0 registros duplicados
      unnamed:_0   age attrition businesstravel  daily_rate  \
0              0  51.0        No            NaN       684.0
1              1  52.0        No            NaN       699.0
2              2  42.0        No  travel_rarely       532.0
3              3  47.0        No  travel_rarely       359.0
4              4  46.0        No            NaN      1319.0
...          ...   ...       ...            ...         ...
1609        1609  36.0       Yes  travel_rarely       530.0
1610        1610  45.0        No     non-travel       805.0
1611        1611  39.0        No  travel_rarely       903.0
1612        1612  36.0        No     non-travel      1229.0
1613        1613  46.0        No            NaN       566.0

                    department  distance_from_home  education  \
0                          NaN            6.000000          3
1                          NaN            1.000000          4
2      Research & Development             4.000000          2
3                          NaN            2.000000          4
4                          NaN            3.000000          3
...                        ...                 ...        ...
1609                       NaN            3.000000          1
1610                       NaN            4.000000          2
1611                       NaN            4.527261          5
1612                       NaN            8.000000          4
1613                       NaN            7.000000          2

       education_field  environment_satisfaction  gender hourly_rate  \
0                  NaN                         1  Female          51
1        Life Sciences                         3  Female          65
2     Technical Degree                         3  Female          58
3              Medical                         1    Male          82
4     Technical Degree                         1    Male          45
...                ...                       ...     ...         ...
1609     Life Sciences                         3  Female          51
1610               NaN                         3  Female          57
1611               NaN                        13  Female          41
1612  Technical Degree                         1  Female          84
1613           Medical                         4  Female          75

      job_involvement  job_level                   jobrole  job_satisfaction  \
0                   3          5        research director                  3
1                   2          5                  manager                  3
2                   3          5                  manager                  4
3                   3          4        research director                  3
4                   4          4          sales executive                  1
...               ...        ...                       ...               ...
1609                2          3          sales executive                  4
1610                3          2    laboratory technician                  2
1611                4          3          sales executive                  3
1612                3          2          sales executive                  4
1613                3          3   manufacturing director                  3

     maritalstatus monthly_income  monthly_rate  num_companies_worked  \
0              NaN        19537,0          6462                     7
1              NaN        19999,0          5678                     0
2          Married        19232,0          4933                     1
3          Married        17169,0         26703                     3
4         Divorced            NaN          7739                     2
...            ...            ...           ...                   ...
1609       Married        10325,0          5518                     1
1610           NaN         4447,0         23163                     1
1611        Single            NaN          2560                     0
1612      Divorced            NaN         25952                     4
1613           NaN        10845,0         24208                     6

     overtime  percent_salary_hike performance_rating  \
0          No                   13                3,0
1         NaN                   14                3,0
2          No                   11                3,0
3         NaN                   19                3,0
4          No                   12                3,0
...       ...                  ...                ...
1609      NaN                   11                NaN
1610      NaN                   12                3,0
1611       No                   18                3,0
1612       No                   13                NaN
1613      NaN                   13                3,0

      relationship_satisfaction  stock_option_level  total_working_years  \
0                             3                   0                  NaN
1                             1                   1                 34.0
2                             4                   0                 22.0
3                             2                   2                  NaN
4                             4                   1                  NaN
...                         ...                 ...                  ...
1609                          1                   1                  NaN
1610                          2                   0                  NaN
1611                          4                   0                  9.0
1612                          4                   2                 12.0
1613                          2                   1                  NaN

      training_times_last_year work_life_balance  years_at_company  \
0                            5               3,0                20
1                            5               3,0                33
2                            3               NaN                22
3                            2               NaN                20
4                            5               3,0                19
...                        ...               ...               ...
1609                         6               3,0                16
1610                         5               2,0                 9
1611                         3               3,0                 8
1612                         3               3,0                 7
1613                         3               3,0                 8

     years_in_current_role  years_since_last_promotion  \
0                      NaN                          15
1                      NaN                          11
2                      NaN                          11
3                      NaN                           5
4                      NaN                           2
...                    ...                         ...
1609                   NaN                           3
1610                   NaN                           0
1611                   NaN                           0
1612                   NaN                           0
1613                   NaN                           0

      years_with_curr_manager  date_birth       salary  \
0                          15        1972  1000000000$
1                           9        1971  1000000000$
2                          15        1981  1000000000$
3                           6        1976  1000000000$
4                           8        1977  1000000000$
...                       ...         ...          ...
1609                        7        1987  1000000000$
1610                        8        1978  1000000000$
1611                        7        1984  1000000000$
1612                        7        1987  1000000000$
1613                        7        1977  1000000000$

                          role_departament  number_children remote_work
0                                      NaN              NaN         Yes
1                                      NaN              NaN           1
2      ManaGER  -  Research & Development               NaN           1
3                                      NaN              NaN       False
4                                      NaN              NaN           0
...                                    ...              ...         ...
1609                                   NaN              NaN           0
1610                                   NaN              NaN           1
1611                                   NaN              NaN         Yes
1612                                   NaN              NaN        True
1613                                   NaN              NaN           0

[1614 rows x 37 columns]

In [11]:
df.to_csv("2_df_transformacion_datos.csv", index=False)

In [12]:
df.head()

,unnamed:_0,age,attrition,businesstravel,daily_rate,department,distance_from_home,education,education_field,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,jobrole,job_satisfaction,maritalstatus,monthly_income,monthly_rate,num_companies_worked,overtime,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,date_birth,salary,role_departament,number_children,remote_work
0,0,51.0,No,NaN,684.0,NaN,6.0,3,NaN,1,Female,51,3,5,research director,3,NaN,"19537,0",6462,7,No,13,"3,0",3,0,NaN,5,"3,0",20,NaN,15,15,1972,1000000000$,NaN,NaN,Yes
1,1,52.0,No,NaN,699.0,NaN,1.0,4,Life Sciences,3,Female,65,2,5,manager,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,34.0,5,"3,0",33,NaN,11,9,1971,1000000000$,NaN,NaN,1
2,2,42.0,No,travel_rarely,532.0,Research & Development,4.0,2,Technical Degree,3,Female,58,3,5,manager,4,Married,"19232,0",4933,1,No,11,"3,0",4,0,22.0,3,NaN,22,NaN,11,15,1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47.0,No,travel_rarely,359.0,NaN,2.0,4,Medical,1,Male,82,3,4,research director,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,NaN,5,6,1976,1000000000$,NaN,NaN,False
4,4,46.0,No,NaN,1319.0,NaN,3.0,3,Technical Degree,1,Male,45,4,4,sales executive,1,Divorced,NaN,7739,2,No,12,"3,0",4,1,NaN,5,"3,0",19,NaN,2,8,1977,1000000000$,NaN,NaN,0

In [13]:
# Identificacion y selecccion de variables con nulos.
def identificar_tratamiento_nulos(df):
    # Calcular el porcentaje de valores nulos.
    nulos = df.isnull().sum() / df.shape[0] * 100
    # Mostrar solo valores nulos
    nulos = nulos[nulos > 0]
    # Ordenar los valores nulos de mayor a menor y redondear a 2 decimales.
    nulos = nulos.sort_values(ascending=False).round(2)
    print(f"\nEl porcentaje de mis variables con nulos es (antes de eliminar columnas):")
    print(nulos)
    # Eliminar las columnas con más del 70% de valores nulos.
    umbral = 70
    columnas_nulas = nulos[nulos > umbral].index
    df = df.drop(columns=columnas_nulas)
    print(f"\nSe han eliminado las columnas con más del {umbral}% de valores nulos")
    # Calcular el porcentaje de valores nulos después de eliminar columnas.
    nulos_despues = df.isnull().sum() / df.shape[0] * 100
    nulos_despues = nulos_despues[nulos_despues > 0]
    nulos_despues = nulos_despues.sort_values(ascending=False).round(2)
    print(f"\nEl porcentaje de mis variables con nulos es (después de eliminar columnas):")
    print(nulos_despues)
    return df
# Llamamos a la función
df = identificar_tratamiento_nulos(df)
# Mostramos los primeros registros para verificar los cambios efectuados.
print(df.head())

El porcentaje de mis variables con nulos es (antes de eliminar columnas):
number_children          100.00
years_in_current_role     97.89
role_departament          81.29
department                81.29
monthly_income            52.23
businesstravel            47.83
education_field           46.16
overtime                  41.88
maritalstatus             40.33
total_working_years       32.59
performance_rating        12.08
daily_rate                 7.68
work_life_balance          6.69
dtype: float64

Se han eliminado las columnas con más del 70% de valores nulos

El porcentaje de mis variables con nulos es (después de eliminar columnas):
monthly_income         52.23
businesstravel         47.83
education_field        46.16
overtime               41.88
maritalstatus          40.33
total_working_years    32.59
performance_rating     12.08
daily_rate              7.68
work_life_balance       6.69
dtype: float64
   unnamed:_0   age attrition businesstravel  daily_rate  distance_from_home  \
0           0  51.0        No            NaN       684.0                 6.0
1           1  52.0        No            NaN       699.0                 1.0
2           2  42.0        No  travel_rarely       532.0                 4.0
3           3  47.0        No  travel_rarely       359.0                 2.0
4           4  46.0        No            NaN      1319.0                 3.0

   education   education_field  environment_satisfaction  gender hourly_rate  \
0          3               NaN                         1  Female          51
1          4     Life Sciences                         3  Female          65
2          2  Technical Degree                         3  Female          58
3          4           Medical                         1    Male          82
4          3  Technical Degree                         1    Male          45

   job_involvement  job_level              jobrole  job_satisfaction  \
0                3          5   research director                  3
1                2          5             manager                  3
2                3          5             manager                  4
3                3          4   research director                  3
4                4          4     sales executive                  1

  maritalstatus monthly_income  monthly_rate  num_companies_worked overtime  \
0           NaN        19537,0          6462                     7       No
1           NaN        19999,0          5678                     0      NaN
2       Married        19232,0          4933                     1       No
3       Married        17169,0         26703                     3      NaN
4      Divorced            NaN          7739                     2       No

   percent_salary_hike performance_rating  relationship_satisfaction  \
0                   13                3,0                          3
1                   14                3,0                          1
2                   11                3,0                          4
3                   19                3,0                          2
4                   12                3,0                          4

   stock_option_level  total_working_years  training_times_last_year  \
0                   0                  NaN                         5
1                   1                 34.0                         5
2                   0                 22.0                         3
3                   2                  NaN                         2
4                   1                  NaN                         5

  work_life_balance  years_at_company  years_since_last_promotion  \
0               3,0                20                          15
1               3,0                33                          11
2               NaN                22                          11
3               NaN                20                           5
4               3,0                19                           2

   years_with_curr_manager  date_birth       salary remote_work
0                       15        1972  1000000000$         Yes
1                        9        1971  1000000000$           1
2                       15        1981  1000000000$           1
3                        6        1976  1000000000$       False
4                        8        1977  1000000000$           0

In [14]:
df_raw.dtypes

unnamed:_0                      int64
age                           float64
attrition                      object
businesstravel                 object
daily_rate                    float64
department                     object
distance_from_home            float64
education                       int64
education_field                object
employee_count                  int64
employee_number                object
environment_satisfaction        int64
gender                         object
hourly_rate                    object
job_involvement                 int64
job_level                       int64
jobrole                        object
job_satisfaction                int64
maritalstatus                  object
monthly_income                 object
monthly_rate                    int64
num_companies_worked            int64
over18                         object
overtime                       object
percent_salary_hike             int64
performance_rating             object
relationship_satisfaction       int64
standard_hours                 object
stock_option_level              int64
total_working_years           float64
training_times_last_year        int64
work_life_balance              object
years_at_company                int64
years_in_current_role          object
years_since_last_promotion      int64
years_with_curr_manager         int64
sameasmonthly_income           object
date_birth                      int64
salary                         object
role_departament               object
number_children               float64
remote_work                    object
dtype: object

In [15]:
df.to_csv("3_df_identificar_tratamiento_nulos.csv", index=False)

In [16]:
# Identificar variables categóricas y numéricas
def categoricas_y_numericas (df):
    # Identificar variables categóricas
    categoricas = df.select_dtypes(include=['object']).columns
    print(f"\nVariables categóricas: {categoricas}")
    # Identificar variables numéricas
    numericas = df.select_dtypes(include=['float64', 'int64']).columns
    print(f"\nVariables numéricas: {numericas}")
    return categoricas, numericas
# Llamamos a la función
categoricas, numericas = categoricas_y_numericas(df)

Variables categóricas: Index(['attrition', 'businesstravel', 'education_field', 'gender',
       'hourly_rate', 'jobrole', 'maritalstatus', 'monthly_income', 'overtime',
       'performance_rating', 'work_life_balance', 'salary', 'remote_work'],
      dtype='object')

Variables numéricas: Index(['unnamed:_0', 'age', 'daily_rate', 'distance_from_home', 'education',
       'environment_satisfaction', 'job_involvement', 'job_level',
       'job_satisfaction', 'monthly_rate', 'num_companies_worked',
       'percent_salary_hike', 'relationship_satisfaction',
       'stock_option_level', 'total_working_years', 'training_times_last_year',
       'years_at_company', 'years_since_last_promotion',
       'years_with_curr_manager', 'date_birth'],
      dtype='object')

In [17]:
#Estrategia:
    # Con más de un 40% de nulos.
    ## monthly_income (categorico)       businesstravel()      education_field       overtime            maritalstatus  
    # Con un % bajo nulos.
    ## total_working_years    performance_rating     daily_rate    work_life_balance

In [18]:
# Imputamos según el porcentaje y el tipo de variable.
def imputar_valores_nulos(df):
    # Imputar valores nulos en variables numéricas
    for col in numericas:
        df[col] = df[col].fillna(df[col].mean())
    # Imputar valores nulos en variables categóricas
    for col in categoricas:
        df[col] = df[col].fillna(df[col].mode()[0])
    # Verificar si hay valores nulos
    nulos_despues = df.isnull().sum().sum()
    print(f"\nTotal de valores nulos después de la imputación: {nulos_despues}")
    return df
# Llamamos a la función
df = imputar_valores_nulos(df)

Total de valores nulos después de la imputación: 0

In [19]:
# 6.3. Aplicación de estrategias dependiendo de distintos factores:

# - Importancia de las variables dentro del análisis:
    #   - SI importante: se queda
    #   - NO importante: se elimina 

# - Tipo de variables:
# - Categóricas: (ENTRE UN 5 Y UN 10 el% SE ENTIENDE COMO BAJO)
#       - % ALTO nulos: 
#                -> categoría dominante se imputan con la moda (a no ser que sea practicamente la única, que entonces considerar eliminar)
#                -> categoría no dominante se imputan con técnicas más avanzadas
#       - % BAJO nulos:
#                -> distribución de categoría dominante -> imputación con la moda
#                -> distribución no dominante -> nueva categoría
# - Numéricas:
#       - % ALTO nulos:
#                 - se imputan con técnicas más avanzadas
# - % BAJO nulos:
#                 - distribución simétrica: imputación con la media
#                 - distribución asimétrica: imputación con la mediana

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 33 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   unnamed:_0                  1614 non-null   int64
 1   age                         1614 non-null   float64
 2   attrition                   1614 non-null   object
 3   businesstravel              1614 non-null   object
 4   daily_rate                  1614 non-null   float64
 5   distance_from_home          1614 non-null   float64
 6   education                   1614 non-null   int64
 7   education_field             1614 non-null   object
 8   environment_satisfaction    1614 non-null   int64
 9   gender                      1614 non-null   object
 10  hourly_rate                 1614 non-null   object
 11  job_involvement             1614 non-null   int64
 12  job_level                   1614 non-null   int64
 13  jobrole                     1614 non-null   object
 14  job_satisfaction            1614 non-null   int64
 15  maritalstatus               1614 non-null   object
 16  monthly_income              1614 non-null   object
 17  monthly_rate                1614 non-null   int64
 18  num_companies_worked        1614 non-null   int64
 19  overtime                    1614 non-null   object
 20  percent_salary_hike         1614 non-null   int64
 21  performance_rating          1614 non-null   object
 22  relationship_satisfaction   1614 non-null   int64
 23  stock_option_level          1614 non-null   int64
 24  total_working_years         1614 non-null   float64
 25  training_times_last_year    1614 non-null   int64
 26  work_life_balance           1614 non-null   object
 27  years_at_company            1614 non-null   int64
 28  years_since_last_promotion  1614 non-null   int64
 29  years_with_curr_manager     1614 non-null   int64
 30  date_birth                  1614 non-null   int64
 31  salary                      1614 non-null   object
 32  remote_work                 1614 non-null   object
dtypes: float64(4), int64(16), object(13)
memory usage: 416.2+ KB